{"-3150":{"message":"General System Error","detail":"Contact technical support"},"-3240":{"message":"Invalid parameters array","detail":"Use a (x,1) array (zero based)"},"-1045":{"message":"Failed: Recipient postal address could not be extracted from the document","detail":"Verify that the address is correctly positioned."},"-910":{"message":"In Process","detail":"Letter is being processed. Processing may take a few hours."},"-3146":{"message":"Specified pre-uploaded document does not exist","detail":"The specified template does not exist or the user does not have permissions to use it."},"-3145":{"message":"One or more of the fields in the XML merge data is missing from the selected template","detail":"The XML must not contain a field that does not appear in the template. Read more."},"-3147":{"message":"Uploading a file and a template in the same request is not allowed","detail":"It is not possible to upload a file and refer to a template in the same request. Please check the syntax of FileExtension in your code."},"-3142":{"message":"Image side: This file cannot be used as a template","detail":"The file specified for the image side cannot be used as a template."},"-3144":{"message":"The XML merge data is invalid","detail":"The XML data provided as merge data is invalid."},"-3143":{"message":"Address side: This file cannot be used as a template","detail":"The file specified for the address side cannot be used as a template."},"-995":{"message":"Waiting For Delivery","detail":"Letter was processed and is waiting to be dispatched to the postal agency. This may take up to one business day."},"-990":{"message":"Not enough funds available","detail":"Attention Needed. The account does not have enough funds to process the letter. If additional funds are added in the Account section of the Control Panel within 72 hours, the letter will continue being processed immediately thereafter."},"-900":{"message":"Received","detail":"Letter was received and queued for processing"},"-3225":{"message":"Invalid value: Feedback_Email_WhenToSend_Completed","detail":"An allowed value must be used"},"-3224":{"message":"Invalid value: Feedback_Email_WhenToSend_EmailReceived","detail":"An allowed value must be used"},"-3223":{"message":"Invalid value: Feedback_FeedbackType","detail":"An allowed value must be used"},"-3222":{"message":"Invalid value: Postcards_DefaultScaling","detail":"An allowed value must be used"},"-3221":{"message":"Invalid value: Letters_PrintSides","detail":"An allowed value must be used"},"-3220":{"message":"Invalid value: Letters_PrintColor","detail":"An allowed value must be used"},"-3228":{"message":"Invalid value: Feedback_Email_DefaultFeedbackEmail","detail":"An allowed value must be used"},"-3229":{"message":"Invalid value: Feedback_Email_Authentication","detail":"An allowed value must be used"},"-3226":{"message":"Invalid value: Feedback_Email_WhenToSend_Error","detail":"An allowed value must be used"},"-3227":{"message":"Invalid value: Feedback_Email_WhenToSend_BatchErrors","detail":"An allowed value must be used"},"-1065":{"message":"Failed: Too many sheets of paper","detail":"The letter contains more sheets of paper than may be inserted into the selected envelope. For example, a No. 10 envelope may hold up to 7 sheets of paper."},"-3160":{"message":"File does not exist","detail":"The file name specified does not exist. Make sure you are using the <file name>.<file extension> format."},"-3020":{"message":"Rejected: file specified is currently unavailable","detail":"The requested PDF is currently unavailable. Possible causes: (1) file is still being processed, (2) file was deleted due to enhanced privacy settings, (3) file was deleted due to age limitations."},"-3162":{"message":"Too many uploaded files","detail":"This account has reached its file quota. Check the System Limitations page."},"-3022":{"message":"Cancellation Denied: The letter was physically processed and cannot be cancelled or is already cancelled","detail":"It is not possible to cancel the letter delivery because the letter was already processed and queued for delivery to the postal agency or it may have been cancelled already."},"-3161":{"message":"Insufficient Permissions","detail":"This user does not have permissions to access this file. See File Permissions."},"-3234":{"message":"Invalid value: Feedback_Post_Authentication","detail":"An allowed value must be used"},"-3164":{"message":"Only Administrator can upload file as account","detail":"Only users with Administrator permissions are allowed to upload a file with Account permissions. See File Permissions."},"-3233":{"message":"Invalid value: Feedback_Post_FeedbackURL","detail":"An allowed value must be used"},"-3163":{"message":"No files for the account","detail":"No files were uploaded for this account."},"-3236":{"message":"Invalid value: Feedback_Soap_WhenToSend_Error","detail":"An allowed value must be used"},"-3235":{"message":"Invalid value: Feedback_Soap_WhenToSend_Completed","detail":"An allowed value must be used"},"-3165":{"message":"User does not have an API key assigned","detail":"There is no API Key for this user. Please generate one first."},"-3230":{"message":"Invalid value: Feedback_Post_WhenToSend_Completed","detail":"An allowed value must be used"},"-3232":{"message":"Invalid value: Feedback_Post_WhenToSend_BatchErrors","detail":"An allowed value must be used"},"-3231":{"message":"Invalid value: Feedback_Post_WhenToSend_Error","detail":"An allowed value must be used"},"-3237":{"message":"Invalid value: Feedback_Soap_WhenToSend_BatchErrors","detail":"An allowed value must be used"},"-3238":{"message":"Invalid value: Feedback_Soap_FeedbackURL","detail":"An allowed value must be used"},"-3239":{"message":"Invalid value: Feedback_Soap_Authentication","detail":"An allowed value must be used"},"-4014":{"message":"The MergeData field is empty or missing","detail":"MergeData is a required field. MergeData should contain the XML or binary representation of the XML to be used as the merge data source. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-4015":{"message":"Missing field: APIKey","detail":"The APIKey field is required."},"-3117":{"message":"Rejected: Company field contains more than 45 characters","detail":"The company property is limited to 45 characters."},"-4013":{"message":"Invalid ID or IDs","detail":"ID field should be either an integer, a range of integers (e.g., 1021984-1021994) or a list of comma separated integers (e.g., 1021984,1021985,1021986)."},"-3116":{"message":"Warning: the specified letter is unavailable","detail":"The specified item ID does not exist in the system."},"-4010":{"message":"The MinID field is empty or missing","detail":"MinID is a required field. MinID should contain the ID of the first letter in the range you querying about. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-3119":{"message":"Rejected: Address2 field contains more than 45 characters","detail":"Field Address2 is limited to 45 characters."},"-4011":{"message":"The MaxID field is empty or missing","detail":"MaxID is a required field. MaxID should contain the ID of the last letter in the range you are querying about. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-3118":{"message":"Rejected: Address1 field contains more than 45 characters","detail":"Field Address1 is limited to 45 characters."},"-1002":{"message":"Completed: successfully completed in \"Development\" work mode","detail":"Letter handling is complete, but the letter will not be physically processed or delivered to the postal agency."},"-3113":{"message":"Rejected: city field contains more than 30 characters","detail":"The city property is limited to 30 characters."},"-3114":{"message":"Rejected: state field contains more than 30 characters","detail":"The state property is limited to 30 characters."},"-3115":{"message":"Warning: no data was returned for you query","detail":"Your query did not return any results."},"-3010":{"message":"Rejected: no funds available to the account","detail":"Your account does not have the necessary balance to process your letter. Check your balance and purchase a new prepaid card."},"-3209":{"message":"No more users allowed","detail":"This account has reached the limit for the number of users allowed. To increase this limit, please Contact Us."},"-1099":{"message":"Failed: Internal Error","detail":"Processing failed due to an internal error. Contact technical support."},"-3210":{"message":"Last administrator for account","detail":"This user is the last administrator for this account. At least one user with Administrator permissions must exist in an account."},"-3211":{"message":"User does not exist for this account","detail":"This user does not exist for this account."},"-3212":{"message":"One or more of the parameters are invalid","detail":"Please verify that your parameter names appear in this list."},"-3213":{"message":"Invalid value: General_Username","detail":"An allowed value must be used"},"-3500":{"message":"Warning: too many attempts were made for this method","detail":"Check the System Limitations page."},"-3214":{"message":"Invalid value: General_Description","detail":"An allowed value must be used"},"-1018":{"message":"Failed: Provided US address cannot be verified","detail":"US addresses must be verified by CASS and DPV. Make sure the address provided contains all address details."},"-1010":{"message":"Failed: no funds available to process the letter","detail":"Account does not have sufficient funds to process the letter."},"-3000":{"message":"OK","detail":"Successfully received the Web Service request."},"-3216":{"message":"Invalid value: General_WordMode","detail":"An allowed value must be used"},"-3001":{"message":"This user is not authorized to access the specified item","detail":"This user is not authorized to access the specified item"},"-3215":{"message":"Invalid value: General_Timezone","detail":"An allowed value must be used"},"-3218":{"message":"Invalid value: Security_AdministrativeEmail","detail":"An allowed value must be used"},"-3217":{"message":"Invalid value: Security_Password","detail":"An allowed value must be used"},"-3004":{"message":"The specified file extension is not supported","detail":"The extension specified in FileExtension is not a Supported file type."},"-3219":{"message":"Invalid value: Security_KeepContentOnServer","detail":"An allowed value must be used"},"-3002":{"message":"User was actively blocked","detail":"This user was actively blocked by PostalMethods. Please contact support@postalmethods.com for more details."},"-3003":{"message":"Not Authenticated","detail":"API key does not exist or Username does not exist or username and password do not match."},"-3139":{"message":"Address side: The XML merge data is invalid","detail":"The XML provided as the merge data source for the address side is invalid."},"-3138":{"message":"Image side: The XML merge data is invalid","detail":"The XML provided as the merge data source for the image side is invalid."},"-3130":{"message":"Unsupported file extension in ImageSideFileType","detail":"File extension provided for ImageSideFileType is unsupported."},"-3131":{"message":"Unsupported file extension in AddressSideFileType","detail":"File extension provided for AddressSideFileType is unsupported."},"-1021":{"message":"Failed: Invalid page size","detail":"One of the document's page size is set to an unsupported size. See supported page sizes."},"-3132":{"message":"The ImageSideBinaryData field is empty or missing","detail":"ImageSideBinaryData must contain your document or image as BASE64 binary data. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-3133":{"message":"The AddressSideBinaryData field is empty or missing","detail":"AddressSideBinaryData must contain your document or image as BASE64 binary data. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-3134":{"message":"File name provided in ImageSideFileType does not exist for this user","detail":"The provided file name does not exist for this user. The file name may be inaccurate or it may have been deleted."},"-3135":{"message":"File name provided in AddressSideFileType does not exist for this user","detail":"The provided file name does not exist for this user. The file name may be inaccurate or it may have been deleted."},"-1025":{"message":"Failed: A document could not be processed","detail":"Make sure your documents contain no macros. Verify that you can view your document locally. If the document appears OK, contact technical support."},"-3136":{"message":"Image side: One or more of the fields is missing from the template","detail":"One or more of the merge fields provided for the image side does not correspond to a place holder in the template specified."},"-3137":{"message":"Address side: One or more of the fields is missing from the template","detail":"One or more of the merge fields provided for the address side does not correspond to a place holder in the template specified."},"-3129":{"message":"The AddressSideFileType field is empty or missing","detail":"AddressSideFileType is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-3128":{"message":"The ImageSideFileType field is empty or missing","detail":"ImageSideFileType is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-4001":{"message":"The Username field is empty or missing","detail":"Username is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you're using. Contact technical support for further assistance."},"-3127":{"message":"File name already exists","detail":"Used file name already exists for this user. File names cannot be duplicated."},"-4002":{"message":"The Password field is empty or missing","detail":"Password is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-4003":{"message":"The MyDescription field is empty or missing","detail":"Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-4004":{"message":"The FileExtension field is empty or missing","detail":"FileExtension is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-4005":{"message":"The FileBinaryData field is empty or missing","detail":"FileBinaryData is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-4006":{"message":"The Address1 field is empty or missing","detail":"Address1 is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Please post your code on our forum for further assistance."},"-4008":{"message":"The Attention1 or Company fields are empty or missing","detail":"At least one of either Attention1 or Company fields must contain a value. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-3121":{"message":"Rejected: AttentionLine2 field contains more than 45 characters","detail":"Field AttentionLine2 is limited to 45 characters."},"-4007":{"message":"The City field is empty or missing","detail":"City is a required field. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-3122":{"message":"Rejected: AttentionLine3 field contains more than 45 characters","detail":"Field AttentionLine3 is limited to 45 characters."},"-4009":{"message":"The ID field is empty or missing","detail":"ID is a required field. ID should contain the ID of the letter you querying about. Please make sure that you did not send a null string. If it is missing, the problem might be caused by the SOAP package you use. Contact technical support for further assistance."},"-3120":{"message":"Rejected: AttentionLine1 field contains more than 45 characters","detail":"Field AttentionLine1 is limited to 45 characters."},"-3125":{"message":"Only account administrators are allowed access to this information","detail":"This information may be accessed by users with Administrator permissions only."},"-3126":{"message":"Invalid file name","detail":"File name should be in the format: FileName.Ext"},"-3123":{"message":"Rejected: PostalCode\/ZIP field contains more than 15 characters","detail":"Postal Code \/ ZIP field is limited to 15 characters."},"-3124":{"message":"Rejected: Country field contains more than 30 characters","detail":"Country field is limited to 30 characters."}}
